export const questions = [
  {
    question: "새로운 사람들과의 파티에 가면",
    choices: [
      { text: "다양한 사람들과 어울리며 에너지를 얻는다", type: "E" },
      { text: "소수의 사람들과 깊은 대화를 나누는 것을 선호한다", type: "I" },
    ],
  },
  {
    question: "주말 계획을 세울 때",
    choices: [
      { text: "구체적인 계획을 미리 세우고 따르는 것을 좋아한다", type: "J" },
      { text: "상황에 따라 유연하게 행동하는 것을 즐긴다", type: "P" },
    ],
  },
  {
    question: "문제를 해결할 때",
    choices: [
      { text: "논리적이고 객관적인 분석을 바탕으로 결정한다", type: "T" },
      { text: "사람들과의 관계나 감정을 중요하게 고려한다", type: "F" },
    ],
  },
  {
    question: "새로운 아이디어를 접했을 때",
    choices: [
      { text: "미래의 가능성과 비전을 먼저 상상한다", type: "N" },
      { text: "현재의 실용성과 현실적인 적용을 중요하게 생각한다", type: "S" },
    ],
  },
  {
    question: "혼자 시간을 보낼 때",
    choices: [
      { text: "재충전의 시간으로, 조용히 보내는 것을 즐긴다", type: "I" },
      { text: "가끔은 지루함을 느끼고 활동적인 것을 찾는다", type: "E" },
    ],
  },
  {
    question: "결정을 내릴 때",
    choices: [
      { text: "원칙과 논리를 기반으로 한 공정한 결정이 중요하다", type: "T" },
      { text: "상황에 관련된 사람들의 감정을 먼저 생각한다", type: "F" },
    ],
  },
  {
    question: "여행을 간다면",
    choices: [
      { text: "가보고 싶은 곳 목록을 만들어 계획적으로 움직인다", type: "J" },
      { text: "발길 닿는 대로, 예상치 못한 발견을 즐긴다", type: "P" },
    ],
  },
  {
    question: "대화를 나눌 때",
    choices: [
      { text: "구체적인 사실과 경험에 대해 이야기하는 것을 좋아한다", type: "S" },
      { text: "추상적인 개념이나 미래의 가능성에 대해 토론하는 것을 즐긴다", type: "N" },
    ],
  },
  {
    question: "업무를 처리할 때",
    choices: [
      { text: "여러 가지 일을 동시에 처리하는 것을 선호한다", type: "E" },
      { text: "한 번에 한 가지 일에 집중하여 처리하는 것이 효율적이다", type: "I" },
    ],
  },
  {
    question: "영화를 보고 나서",
    choices: [
      { text: "영화의 상징이나 숨겨진 의미에 대해 생각한다", type: "N" },
      { text: "영화의 줄거리와 실제적인 장면에 대해 이야기한다", type: "S" },
    ],
  },
  {
    question: "친구와의 약속이 갑자기 취소되면",
    choices: [
      { text: "미리 세워둔 다른 계획을 하거나, 즉흥적으로 무언가를 찾는다", type: "P" },
      { text: "계획이 틀어진 것에 아쉬움을 느끼고, 집에서 시간을 보낸다", type: "J" },
    ],
  },
  {
    question: "다른 사람을 도울 때",
    choices: [
      { text: "실질적인 해결책을 제시하는 것이 중요하다고 생각한다", type: "T" },
      { text: "따뜻한 위로와 공감을 표현하는 것이 우선이라고 생각한다", type: "F" },
    ],
  },
];
